-- phpMyAdmin SQL Dump
-- version 5.0.2
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Янв 27 2021 г., 02:31
-- Версия сервера: 10.3.22-MariaDB
-- Версия PHP: 7.1.33

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `es1`
--

-- --------------------------------------------------------

--
-- Структура таблицы `answ`
--

CREATE TABLE `answ` (
  `id` int(8) NOT NULL,
  `answer` varchar(256) CHARACTER SET utf8mb4 NOT NULL,
  `question` varchar(256) CHARACTER SET utf8mb4 NOT NULL,
  `order_quest` int(2) NOT NULL,
  `chat_id` varchar(256) CHARACTER SET utf8mb4 NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `answers`
--

CREATE TABLE `answers` (
  `id` int(8) NOT NULL,
  `answer` varchar(256) CHARACTER SET utf8mb4 NOT NULL,
  `asked` bit(1) NOT NULL DEFAULT b'1',
  `flag_quest` varchar(256) CHARACTER SET utf8mb4 NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `answers`
--

INSERT INTO `answers` (`id`, `answer`, `asked`, `flag_quest`) VALUES
(4, 'м', b'1', 'Ваш пол?'),
(5, 'ж', b'1', 'Ваш пол?'),
(6, 'эктоморф', b'1', 'Ваше телосложение?'),
(7, 'мезоморф', b'1', 'Ваше телосложение?'),
(8, 'эндоморф', b'1', 'Ваше телосложение?'),
(9, 'незнаю', b'1', 'Ваше телосложение?'),
(13, 'нет', b'1', 'Опыт занятий спортом ?'),
(14, 'менее 2 лет', b'1', 'Опыт занятий спортом ?'),
(15, 'от 2 до 5 лет', b'1', 'Опыт занятий спортом ?'),
(16, 'более 5 лет ', b'1', 'Опыт занятий спортом ?'),
(17, 'похудеть', b'1', 'Какие у Вас цели?'),
(18, 'набрать мышечную массу', b'1', 'Какие у Вас цели?'),
(19, 'увеличить выносливость', b'1', 'Какие у Вас цели?'),
(20, 'увеличить силу', b'1', 'Какие у Вас цели?'),
(21, 'боевые виды искусств', b'1', 'Каким спортом Вы планируете заниматься?'),
(22, 'бегом', b'1', 'Каким спортом Вы планируете заниматься?'),
(23, 'плавание', b'1', 'Каким спортом Вы планируете заниматься?'),
(24, 'игровой вид спорта', b'1', 'Каким спортом Вы планируете заниматься?'),
(25, 'силовые виды спорта ', b'1', 'Каким спортом Вы планируете заниматься?'),
(26, 'фитнес', b'1', 'Каким спортом Вы планируете заниматься?'),
(27, '1 месяц', b'1', 'В какие сроки Вы планируете добиться поставленной цели?'),
(28, 'от 1 до 3 месяцев ', b'1', 'В какие сроки Вы планируете добиться поставленной цели?'),
(29, 'более 3 месяцев', b'1', 'В какие сроки Вы планируете добиться поставленной цели?'),
(30, 'да', b'1', 'Проходили ли Вы обследования у врача ?'),
(31, 'нет', b'1', 'Проходили ли Вы обследования у врача ?'),
(32, 'ниже нормы', b'1', 'Какой у Вас уровень витамин?'),
(33, 'норма', b'1', 'Какой у Вас уровень витамин?'),
(34, 'выше нормы', b'1', 'Какой у Вас уровень витамин?'),
(35, 'ниже нормы ', b'1', 'Какой у Вас уровень гормонов ?'),
(36, 'норма', b'1', 'Какой у Вас уровень гормонов ?'),
(37, 'выше нормы', b'1', 'Какой у Вас уровень гормонов ?'),
(38, 'да', b'1', 'Есть ли у Вас хронические заболевания ?'),
(39, 'нет', b'1', 'Есть ли у Вас хронические заболевания ?'),
(40, 'сердечно сосудистая система', b'1', 'Какой тип заболеваний у Вас ?'),
(41, 'проблемы жкт', b'1', 'Какой тип заболеваний у Вас ?'),
(42, 'нервная система', b'1', 'Какой тип заболеваний у Вас ?'),
(44, 'проблемы с дыхательной системой', b'1', 'Какой тип заболеваний у Вас ?'),
(45, 'менее 5 тыс.руб', b'1', 'Сколько вы готовы потратить на спортивное питание?'),
(46, 'от 5 до 10 тыс.руб', b'1', 'Сколько вы готовы потратить на спортивное питание?'),
(47, 'более 10 тыс.руб', b'1', 'Сколько вы готовы потратить на спортивное питание?');

-- --------------------------------------------------------

--
-- Структура таблицы `products`
--

CREATE TABLE `products` (
  `id` int(8) NOT NULL,
  `name` varchar(256) NOT NULL,
  `price` varchar(256) NOT NULL,
  `manufacturer` varchar(256) NOT NULL,
  `size` int(5) NOT NULL,
  `type_size` varchar(128) NOT NULL,
  `normal_dosage` int(5) NOT NULL,
  `vitamin` tinyint(1) NOT NULL,
  `test` tinyint(1) NOT NULL,
  `minage_of_use` int(3) NOT NULL,
  `maxage_of_use` int(3) NOT NULL,
  `rec_time_of_use` int(5) NOT NULL,
  `recomendation` varchar(256) NOT NULL,
  `contraindications` varchar(256) NOT NULL,
  `priority` int(3) NOT NULL,
  `levelskills` int(2) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Дамп данных таблицы `products`
--

INSERT INTO `products` (`id`, `name`, `price`, `manufacturer`, `size`, `type_size`, `normal_dosage`, `vitamin`, `test`, `minage_of_use`, `maxage_of_use`, `rec_time_of_use`, `recomendation`, `contraindications`, `priority`, `levelskills`) VALUES
(1, 'протеин', '2300', 'Optimum Nutrition', 907, 'гр', 32, 0, 0, 0, 100, 365, 'СМПВ', 'Б', 1, 1),
(2, 'протеин', '2910', 'Optimum Nutrition', 4850, 'гр', 32, 0, 0, 0, 100, 365, 'СМПВ', 'Б', 1, 1),
(3, 'протеин', '2910', 'Optimum Nutrition', 2270, 'гр', 32, 0, 0, 0, 100, 365, 'СМПВ', 'Б', 1, 1),
(4, 'протеин', '8500', 'Optimum Nutrition', 4540, 'гр', 32, 0, 0, 0, 100, 365, 'СМПВ', 'Б', 1, 1),
(5, 'протеин', '1640', 'Trec Nutrition', 700, 'гр', 30, 0, 0, 0, 100, 365, 'СМПВ', 'Б', 1, 1),
(6, 'казеин', '1860', 'Geneticlab Nutrition', 1000, 'гр', 33, 0, 0, 0, 100, 365, 'П', 'Б', 1, 1),
(7, 'казеин', '1840', 'Trec Nutrition', 600, 'гр', 30, 0, 0, 0, 100, 365, 'П', 'Б', 1, 1),
(8, 'казеин', '4690', 'Trec Nutrition', 1800, 'гр', 30, 0, 0, 0, 100, 365, 'П', 'Б', 1, 1),
(9, 'креатин', '990', 'Trec Nutrition', 600, 'гр', 5, 0, 0, 21, 55, 60, 'СМВ', 'Ж', 3, 2),
(10, 'креатин', '1640', 'Trec Nutrition', 600, 'гр', 5, 0, 0, 21, 55, 60, 'СМВ', 'Ж', 3, 2),
(11, 'креатин', '1500', 'MyProtein', 1000, 'гр', 5, 0, 0, 21, 55, 60, 'СМВ', 'Ж', 3, 2),
(12, 'BCAA', '1690', 'Trec Nutrition', 300, 'гр', 20, 0, 0, 18, 65, 90, 'СМПВ', 'Б', 1, 1),
(13, 'BCAA', '2990', 'Trec Nutrition', 600, 'гр', 20, 0, 0, 18, 65, 90, 'СМПВ', 'Б', 1, 1),
(14, 'BCAA', '1987', 'Quamtrax Nutrition', 500, 'гр', 5, 0, 0, 18, 65, 90, 'СМПВ', 'Б', 1, 1),
(15, 'аминокислоты', '1140', 'Trec Nutrition', 160, 'шт', 8, 0, 0, 18, 65, 90, 'СМПВ', 'НА', 1, 2),
(16, 'аминокислоты', '2040', 'Trec Nutrition', 320, 'шт', 8, 0, 0, 18, 65, 90, 'СМПВ', 'НА', 1, 2),
(17, 'аминокислоты', '2740', 'Trec Nutrition', 450, 'шт', 8, 0, 0, 18, 65, 90, 'СМПВ', 'НА', 1, 2),
(18, 'аминокислоты', '1090', 'Maxler', 120, 'шт', 4, 0, 0, 18, 65, 90, 'СМПВ', 'Б', 1, 2),
(19, 'аминокислоты', '1850', 'Maxler', 240, 'шт', 4, 0, 0, 18, 65, 90, 'СМПВ', 'Б', 1, 2),
(20, 'гейнер', '1490', 'Trec Nutrition', 1000, 'гр', 70, 0, 0, 18, 65, 90, 'М', 'ЖА', 2, 1),
(21, 'гейнер', '2290', 'Trec Nutrition', 2000, 'гр', 70, 0, 0, 18, 65, 90, 'М', 'ЖА', 2, 1),
(22, 'гейнер', '3590', 'Trec Nutrition', 3000, 'гр', 70, 0, 0, 18, 65, 90, 'М', 'ЖА', 2, 1),
(23, 'гейнер', '1240', 'Red Star Labs', 900, 'гр', 50, 0, 0, 18, 65, 90, 'М', 'ЖА', 2, 1),
(24, 'гейнер', '2890', 'Red Star Labs', 2500, 'гр', 50, 0, 0, 18, 65, 90, 'М', 'ЖА', 2, 1),
(25, 'Мультивитамины', '1190', 'Trec Nutrition', 120, 'шт', 2, 1, 0, 18, 65, 60, 'СМПВ', 'Б', 1, 1),
(26, 'Мультивитамины', '2190', 'Trec Nutrition', 240, 'шт', 2, 1, 0, 18, 65, 60, 'СМПВ', 'Б', 1, 1),
(27, 'Мультивитамины', '2190', 'Trec Nutrition', 240, 'шт', 2, 1, 0, 18, 65, 60, 'СМПВ', 'Б', 1, 1),
(28, 'Мультивитамины', '1650', 'Optimum Nutrition', 90, 'шт', 3, 1, 0, 18, 65, 60, 'СМПВ', 'Б', 1, 1),
(29, 'Мультивитамины', '2670', 'Optimum Nutrition', 150, 'шт', 3, 1, 0, 18, 65, 60, 'СМПВ', 'Б', 1, 1),
(30, 'Мультивитамины', '4100', 'Optimum Nutrition', 240, 'шт', 3, 1, 0, 18, 65, 60, 'СМПВ', 'Б', 1, 1),
(31, 'предтренеровочный комплекс', '2890', 'Boogieman', 300, 'гр', 20, 0, 0, 21, 51, 30, 'СМПВ', 'СЖНА', 4, 3),
(32, 'предтренеровочный комплекс', '1790', 'Trec Nutrition', 200, 'гр', 5, 0, 0, 21, 51, 30, 'СМПВ', 'СЖНА', 4, 3),
(33, 'предтренеровочный комплекс', '2390', 'BSN N.O.-Xplode New Formula', 555, 'гр', 18, 0, 0, 21, 51, 30, 'СМПВ', 'СЖНА', 4, 3),
(34, 'жиросжигатель', '1040', 'Trec Nutrition', 90, 'шт', 2, 0, 0, 18, 60, 60, 'П', 'ЖА', 2, 2),
(35, 'жиросжигатель', '1920', 'Trec Nutrition', 180, 'шт', 2, 0, 0, 18, 60, 60, 'П', 'ЖА', 2, 2),
(36, 'жиросжигатель', '1920', 'Burner', 90, 'шт', 3, 0, 0, 18, 60, 60, 'П', 'ЖА', 2, 2),
(37, 'жиросжигатель', '1970', 'Lipo-6 Black Hers', 120, 'шт', 3, 0, 0, 18, 60, 60, 'П', 'ЖА', 2, 2),
(38, 'глютамин', '1987', 'Quamtrax Nutrition', 500, 'гр', 5, 0, 0, 18, 65, 365, 'С', 'Б', 2, 1),
(39, 'глютамин', '1490', 'Trec Nutrition', 200, 'гр', 4, 0, 0, 18, 65, 365, 'С', 'Б', 2, 1),
(40, 'глютамин', '2790', 'Trec Nutrition', 400, 'гр', 4, 0, 0, 18, 65, 365, 'С', 'Б', 2, 1),
(41, 'глютамин', '2690', 'QNT', 500, 'гр', 6, 0, 0, 18, 65, 365, 'С', 'Б', 2, 1),
(42, 'колаген', '1190', 'Red Star Labs', 300, 'гр', 5, 0, 0, 18, 65, 365, 'СМ', 'Б', 2, 2),
(43, 'колаген', '1540', 'Trec Nutrition', 350, 'гр', 5, 0, 0, 18, 65, 365, 'СМ', 'Б', 2, 2),
(44, 'колаген', '849', 'Geneticlab Nutrition', 225, 'гр', 5, 0, 0, 18, 65, 365, 'СМ', 'Б', 2, 2),
(45, 'препараты для повышения тестостерона ', '2487', 'Red Star Labs', 90, 'шт', 1, 0, 1, 21, 65, 30, 'СМВ', 'С', 3, 4),
(46, 'препараты для повышения тестостерона ', '1090', 'Scitec Nutrition', 100, 'шт', 4, 0, 1, 21, 65, 30, 'СМВ', 'С', 3, 4),
(47, 'препараты для повышения тестостерона ', '1170', 'Geneticlab Nutrition', 60, 'шт', 2, 0, 1, 21, 65, 30, 'СМВ', 'С', 3, 4),
(48, 'L-carnitin', '1440', 'Trec Nutrition', 500, 'мл', 13, 0, 0, 18, 65, 30, 'П', 'ЖА', 1, 1),
(49, 'L-carnitin', '2290', 'Trec Nutrition', 1000, 'мл', 13, 0, 0, 18, 65, 30, 'П', 'ЖА', 1, 1),
(50, 'L-carnitin', '1940', 'Scitec Nutrition', 500, 'мл', 13, 0, 0, 18, 65, 30, 'П', 'ЖА', 1, 1);

-- --------------------------------------------------------

--
-- Структура таблицы `quest`
--

CREATE TABLE `quest` (
  `id` int(8) NOT NULL,
  `questions` varchar(256) CHARACTER SET utf8mb4 NOT NULL,
  `parameter` varchar(256) CHARACTER SET utf8mb4 NOT NULL,
  `order_num` int(2) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `quest`
--

INSERT INTO `quest` (`id`, `questions`, `parameter`, `order_num`) VALUES
(2, 'Ваш возраст ?', 'рекомендуемый возраст применения', 1),
(3, 'Ваш пол?', 'вид товара', 2),
(4, 'Ваш рост?', 'нет', 4),
(5, 'Ваш вес?', 'разовая нормальная дозировка', 5),
(8, 'Опыт занятий спортом ?', 'уровень ', 7),
(9, 'Каким спортом Вы планируете заниматься?', 'рекомендации по применению', 8),
(10, 'Какие у Вас цели?', 'рекомендации по применению ', 9),
(11, 'В какие сроки Вы планируете добиться поставленной цели?', 'рекомендуемый период применения', 10),
(12, 'Проходили ли Вы обследования у врача ?', 'противопоказания', 11),
(13, 'Какой у Вас уровень витамин?', 'витамины', 12),
(14, 'Какой у Вас уровень гормонов ?', 'гармоны', 13),
(15, 'Есть ли у Вас хронические заболевания ?', 'противопоказания', 14),
(16, 'Какой тип заболеваний у Вас ?', 'противопоказания', 15),
(17, 'Ваше телосложение?', 'рекомендации по применению', 3),
(18, 'Ваш индекс массы ? ', 'рекомендации по применению', 6),
(19, 'Сколько вы готовы потратить на спортивное питание?', 'цена', 16);

-- --------------------------------------------------------

--
-- Структура таблицы `questresult`
--

CREATE TABLE `questresult` (
  `id` int(8) NOT NULL,
  `if_Par` varchar(256) CHARACTER SET utf8mb4 NOT NULL,
  `if_Value` varchar(256) CHARACTER SET utf8mb4 NOT NULL,
  `nextQuest` int(11) NOT NULL,
  `noAsk` int(11) NOT NULL,
  `num_quest` int(2) NOT NULL,
  `value` varchar(256) CHARACTER SET utf8mb4 NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `questresult`
--

INSERT INTO `questresult` (`id`, `if_Par`, `if_Value`, `nextQuest`, `noAsk`, `num_quest`, `value`) VALUES
(3, 'Рекомендуемый возраст применения', 'Возраст', 2, 0, 1, 'диапозон'),
(4, 'вид товара ', 'м', 3, 0, 2, 'м'),
(5, 'вид товара', 'ж', 3, 0, 2, 'ж'),
(6, 'рекомендации по применению', 'эктоморф', 4, 0, 3, 'М'),
(7, 'рекомендации по применению', 'мезоморф', 4, 0, 3, 'С'),
(8, 'рекомендации по применению', 'эндоморф', 4, 0, 3, 'ПВ'),
(9, 'рекомендации по применению', 'незнаю', 4, 0, 3, 'null'),
(12, 'рекомендации по применению', 'Индекс', 7, 0, 6, 'диапозон'),
(13, 'уровень', 'нет', 9, 0, 7, '1'),
(14, 'уровень', 'менее 2 лет', 8, 0, 7, '2'),
(15, 'уровень', 'от 2 до 5 лет', 8, 0, 7, '3'),
(16, 'уровень', 'более 5 лет', 8, 0, 7, '4'),
(17, 'рекомендации по применению', 'боевые виды искусства ', 9, 0, 8, 'В'),
(18, 'рекомендации по применению', 'бегом', 9, 0, 8, 'В'),
(19, 'рекомендации по применению', 'плаванием', 9, 0, 8, 'В'),
(20, 'рекомендации по применению', 'игровой виды спорта', 9, 0, 8, 'В'),
(21, 'рекомендации по применению', 'силовые виды спорта', 9, 0, 8, 'С'),
(22, 'рекомендации по применению', 'фитнес', 9, 0, 8, 'МС'),
(23, 'рекомендации по применению', 'похудеть', 10, 0, 9, 'П'),
(24, 'рекомендации по применению', 'набрать мышечную массу', 10, 0, 9, 'М'),
(25, 'рекомендации по применению', 'увеличить выносливость', 10, 0, 9, 'В'),
(26, 'рекомендации по применению', 'увеличить силу ', 10, 0, 9, 'С'),
(27, 'рекомендуемый период применения', '1 месяц', 11, 0, 10, '30'),
(28, 'рекомендуемый период применения', 'от 1 до 3 месяцев', 11, 0, 10, '90'),
(29, 'рекомендуемый период применения', 'более 3 месяцев', 11, 0, 10, '365'),
(30, 'противопоказания', 'нет', 14, 0, 11, 'false'),
(31, 'противопоказания', 'да', 12, 0, 11, 'true'),
(32, 'витамины', 'ниже нормы', 13, 0, 12, 'true'),
(33, 'витамины', 'норма', 13, 0, 12, 'true'),
(34, 'витамины', 'выше нормы', 13, 0, 12, 'false'),
(35, 'гармоны', 'ниже нормы', 14, 0, 13, 'true'),
(36, 'гармоны', 'норма', 14, 0, 13, 'true'),
(37, 'гармоны', 'выше нормы', 14, 0, 13, 'false'),
(38, 'противопоказания', 'да', 15, 0, 14, 'true'),
(39, 'противопоказания', 'нет', 16, 0, 14, 'false'),
(40, 'противопоказания', 'сердечно сосудистая система', 16, 0, 15, 'C'),
(41, 'противопоказания', 'проблемы жкт', 16, 0, 15, 'Ж'),
(42, 'противопоказания', 'нервная система', 16, 0, 15, 'Н'),
(44, 'противопоказания', 'проблемы с дыхательной системой', 16, 0, 15, 'Д'),
(45, 'цена', 'менее 5 тыс.руб', 0, 0, 16, '5000'),
(46, 'цена', 'от 5 до 10 тыс.руб', 0, 0, 16, '10000'),
(47, 'цена', 'более 10 тыс.руб', 0, 0, 16, '20000');

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE `users` (
  `id` int(8) NOT NULL,
  `chat_id` varchar(256) CHARACTER SET utf8mb4 NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`id`, `chat_id`) VALUES
(1, '399642640');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `answ`
--
ALTER TABLE `answ`
  ADD PRIMARY KEY (`id`),
  ADD KEY `chat_id` (`chat_id`);

--
-- Индексы таблицы `answers`
--
ALTER TABLE `answers`
  ADD PRIMARY KEY (`id`),
  ADD KEY `flag_quest` (`flag_quest`);

--
-- Индексы таблицы `products`
--
ALTER TABLE `products`
  ADD PRIMARY KEY (`id`),
  ADD KEY `recomendation` (`recomendation`),
  ADD KEY `contraindications` (`contraindications`),
  ADD KEY `recomendation_2` (`recomendation`);

--
-- Индексы таблицы `quest`
--
ALTER TABLE `quest`
  ADD PRIMARY KEY (`id`),
  ADD KEY `questions` (`questions`),
  ADD KEY `order_num` (`order_num`);

--
-- Индексы таблицы `questresult`
--
ALTER TABLE `questresult`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD KEY `chat_id` (`chat_id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `answ`
--
ALTER TABLE `answ`
  MODIFY `id` int(8) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=473;

--
-- AUTO_INCREMENT для таблицы `answers`
--
ALTER TABLE `answers`
  MODIFY `id` int(8) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=48;

--
-- AUTO_INCREMENT для таблицы `products`
--
ALTER TABLE `products`
  MODIFY `id` int(8) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=51;

--
-- AUTO_INCREMENT для таблицы `quest`
--
ALTER TABLE `quest`
  MODIFY `id` int(8) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=20;

--
-- AUTO_INCREMENT для таблицы `questresult`
--
ALTER TABLE `questresult`
  MODIFY `id` int(8) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=48;

--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `id` int(8) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- Ограничения внешнего ключа сохраненных таблиц
--

--
-- Ограничения внешнего ключа таблицы `answ`
--
ALTER TABLE `answ`
  ADD CONSTRAINT `answ_ibfk_1` FOREIGN KEY (`chat_id`) REFERENCES `users` (`chat_id`);

--
-- Ограничения внешнего ключа таблицы `answers`
--
ALTER TABLE `answers`
  ADD CONSTRAINT `answers_ibfk_1` FOREIGN KEY (`flag_quest`) REFERENCES `quest` (`questions`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
